implementation/app/views/order_items/send_data.html.erb

SELECT `order_items`.* FROM `order_items` WHERE `order_items`.`order_id` = 11
SELECT  `products`.* FROM `products` WHERE `products`.`id` = 1 LIMIT 1
---
<h5> Send data </h5>
<% @order.order_items.each  do  |i| %>
<tr>
  <td><%= Product.find(i.product_id).name  %></td>