implementation/app/controllers/order_items_controller.rb

SELECT `order_items`.* FROM `order_items` WHERE `order_items`.`order_id` = 1
INSERT INTO `order_items` (`product_id`, `order_id`, `unit_price`, `quantity`, `total_price`, `created_at`, `updated_at`) VALUES (1, 1, 0.49, 1, 0.49, '2017-05-31 06:10:49', '2017-05-31 06:10:49')
INSERT INTO `orders` (`subtotal`, `order_status_id`, `created_at`, `updated_at`) VALUES (0.49, 1, '2017-05-31 06:10:49', '2017-05-31 06:10:49')
---
  def create
    @order = current_order
    @order_item = @order.order_items.new(order_item_params)
    @order.save

SELECT  `order_items`.* FROM `order_items` WHERE `order_items`.`order_id` = 1 AND `order_items`.`id` = 1 LIMIT 1
SELECT  `orders`.* FROM `orders` WHERE `orders`.`id` = 1 LIMIT 1
UPDATE `order_items` SET `quantity` = 4, `total_price` = 1.96, `updated_at` = '2017-05-31 06:11:49' WHERE `order_items`.`id` = 1
---
  def update
    @order = current_order
    @order_item = @order.order_items.find(params[:id])
    @order_item.update_attributes(order_item_params)

SELECT  `order_items`.* FROM `order_items` WHERE `order_items`.`order_id` = 1 AND `order_items`.`id` = 9 LIMIT 1
SELECT  `orders`.* FROM `orders` WHERE `orders`.`id` = 1 LIMIT 1
DELETE FROM `order_items` WHERE `order_items`.`id` = 9
---
  def destroy
    @order = current_order
    @order_item = @order.order_items.find(params[:id])
    @order_item.destroy

SELECT `order_items`.* FROM `order_items` WHERE `order_items`.`order_id` = 11
---
  def send_data
    @order = current_order
    puts @order
    puts "-----------------ORDER ITEMS ----------------"
    puts @order.order_items